/**********************************************************************************************************
**							文件名：	NMRQ_config.h
**                          文件描述：  本文件为IEACS系统相关配置文件
**                               		包含系统设计相关的数据类型定义、宏定义
**                          作者：		程敏
**							创建时间： 	2013-8-1
**
********************************************************************************************************/


#include "..\Include\OS_CPU.H"
/*
********************************************************************************************************
*                                         系统数据类型定义
*********************************************************************************************************
*/

/********************************************
*	结构体名：TIME
*	功能说明：保存系统时间信息（系统时间、定时时间）
*	使用说明：结构体中包含6项（年、月、日、时、分、秒） 
*			  其中年为INT16U类型，其它均为INT8U类型	
********************************************/

typedef struct time_t{                            
    INT16U         uiTimeYear;           	/* 年	*/
    INT8U      	   uiTimeMonth;             /* 月	*/
    INT8U          uiTimeDay;            	/* 日	*/  

    INT8U          uiTimeHour;        		/* 时 	*/  
    INT8U          uiTimeMinute;       	    /* 分 	*/  
    INT8U          uiTimeSecond;       	    /* 秒	*/  
                                            
} TIME;


/********************************************
*	结构体名：OS_STATE_INFO
*	功能说明：保存系统当前状态信息
*	使用说明：结构体中包含3项 
*			  均为INT8U类型	
********************************************/

typedef struct os_state_info_t{  
    INT8U           uiOSStateCtrlObj;            	/* 	系统控制对象（系统、门灯、卧室灯、空调、热水器）	*/  
                          
    INT8U      	    uiOSStateInfoType;              /*	系统状态信息类型(电器开关、温度、模式、时间）	*/

    INT8U           uiOSStateContent;        		/* 	系统控制对象所对应的信息类型的内容	*/  
													/* 	类型为void的指针（可以为开关信息（0/1）、
														模式（1、2、3、4）、温度、时间	*/
} OS_STATE_INFO;


/********************************************
*	结构体名：LCD_PAGE
*	功能说明：保存LCD界面
*	使用说明：结构体中包含3项 
*			  其中uiLcdPageID为INT8U类型，其它均为指向结构体本身类型的指针	
********************************************/

typedef struct lcd_page_t{  
    INT8U                    uiLcdPageID;            		/* 	LCD界面编码id	*/                           
    INT8U					 uiSubPageNum;					/*	页面中子页面数	*/
	struct lcd_page_t       *lcdPageNextPage[6];            /*	指向下一界面的指针数组	*/
    struct lcd_page_t       *lcdPagePrePage;               	/*	指向前一节目的指针	*/

} LCD_PAGE;


/********************************************
*	结构体名：KEY_INFO
*	功能说明：保存按键信息
*	使用说明：结构体中包含2项 
*			  其中按键类型为BOOLEAN类型，按键值为INT8U类型
********************************************/

typedef struct key_info_t{  
    BOOLEAN          uiKeyType;            				/* 	按键类型（长按/短按）	*/                           
    INT8U          	 uiKeyValue;            			/* 	按键值（4个）	*/                           

} KEY_INFO;



/*
********************************************************************************************************
*                                        	 系统宏定义
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*                                         OS STATE CTRL OBJ
*											系统控制对象
*********************************************************************************************************
*/
#define  OS_STATE_CTRL_OBJ_DOOR_LIGHT      0        /* 	表示当前系统控制对象为 门灯	*/ 
#define  OS_STATE_CTRL_OBJ_BEDROOM_LIGHT   1        /* 	表示当前系统控制对象为 卧室灯	*/ 
#define  OS_STATE_CTRL_OBJ_AIRCONDITION    2        /* 	表示当前系统控制对象为 空调	*/ 
#define  OS_STATE_CTRL_OBJ_CALORIFIER      3        /* 	表示当前系统控制对象为 热水器	*/ 
#define  OS_STATE_CTRL_OBJ_SYS   		   4        /* 	表示当前系统控制对象为 系统	*/ 
#define  OS_STATE_CTRL_OBJ_THIEF   		   5        /* 	表示当前系统控制对象为 小偷中断	*/ 
#define  OS_STATE_CTRL_OBJ_GASLEAK   	   6        /* 	表示当前系统控制对象为 煤气中断	*/ 
#define  OS_STATE_CTRL_OBJ_AD   	  	   7        /* 	表示当前系统控制对象为 AD模块	*/ 

/*
*********************************************************************************************************
*                                         OS STATE INFO TYPE
*										   系统状态信息类型
*********************************************************************************************************
*/
#define  OS_STATE_INFO_TYPE_SWITCH  	   0        /* 	表示当前系统控制对象的信息类型为 开关	*/ 
#define  OS_STATE_INFO_TYPE_TEMP  		   1        /* 	表示当前系统控制对象的信息类型为 温度	*/ 
#define  OS_STATE_INFO_TYPE_MODEL  		   2        /* 	表示当前系统控制对象的信息类型为 模式	*/ 
#define  OS_STATE_INFO_TYPE_TIME  		   3        /* 	表示当前系统控制对象的信息类型为 时间	*/
#define  OS_STATE_INFO_TYPE_TIMEING  	   4        /* 	表示当前系统控制对象的信息类型为 定时	*/
#define  OS_STATE_INFO_TYPE_INT		  	   5        /* 	表示当前系统控制对象的信息类型为 中断	*/
#define  OS_STATE_INFO_TYPE_SENTEMP		   6        /* 	表示当前系统控制对象的信息类型为 感温	*/
#define  OS_STATE_INFO_TYPE_SENLIGHT	   7        /* 	表示当前系统控制对象的信息类型为 感光	*/

/*
*********************************************************************************************************
*                                         OS PC CONNECT STATE
*											系统连接状态
*********************************************************************************************************
*/
#define  OS_PC_CONNECT_STATE_CONNECTLESS  	0        /* 	表示PC端未连接到下位机	*/ 
#define  OS_PC_CONNECT_STATE_CONNECTED  	1        /* 	表示PC端已连接到下位机	*/ 

/*
*********************************************************************************************************
*                                         OS ELEC SWITCH STATE
*											系统电器开关状态
*********************************************************************************************************
*/
#define  OS_ELEC_SWITCH_STATE_OFF  		   0        /* 	表示电器 关	*/ 
#define  OS_ELEC_SWITCH_STATE_ON  		   1        /* 	表示电器 开	*/ 

/*
*********************************************************************************************************
*                                         OS MODEL STATE
*											 系统模式
*********************************************************************************************************
*/
#define  OS_MODEL_STATE_COMMON  		   0        /* 	表示系统当前模式为 普通模式	*/ 
#define  OS_MODEL_STATE_BACK_HOME  		   1        /* 	表示系统当前模式为 回家模式	*/ 
#define  OS_MODEL_STATE_AGAINST_THEFT  	   2        /* 	表示系统当前模式为 防盗模式	*/ 
#define	 OS_MODEL_STATE_GO_OUT  		   3        /* 	表示系统当前模式为 外出模式	*/ 


/*
*********************************************************************************************************
*                                         
*											 布尔值
*********************************************************************************************************
*/
#define		FALSE               0			/*	FALSE为0	*/		
#define		TRUE                1			/*	TRUE为1		*/

/*
*********************************************************************************************************
*                                         
*											 行列线
*********************************************************************************************************
*/
#define		KC0         0x00100000			/*	p0.20引脚控制列线KC0	*/		
#define		KC1         0x00200000			/*	p0.21引脚控制列线KC1	*/	
#define		KH0         0x00400000 			/*	p0.22引脚控制行线KH0	*/		
#define 	KH1         0x00800000			/*	po.21引脚控制行线KH1	*/		
#define		BEEP        0x000000400			/*	p0.10引脚控制BEEP，高电平使能	*/		

/*
*********************************************************************************************************
*                                         
*											 按键
*********************************************************************************************************
*/
#define		KEY_SWI1            1			/*	按键1	*/		
#define		KEY_SWI2            2			/*	按键2	*/	
#define		KEY_SWI3            3			/*	按键3	*/	
#define		KEY_SWI4            4			/*	按键4	*/		
#define		KEY_CLICKED        	TRUE 		/*	按键按下	*/		
#define		KEY_UNCLICKED      	FALSE		/*	按键未按下	*/		
#define		KEY_LONGCLICKED    	TRUE 		/*	按键为长按	*/	
#define		KEY_SHORTCLICKED   	FALSE		/*	按键为短按	*/			


/*
*********************************************************************************************************
*                                         
*											 控制家电
*********************************************************************************************************
*/
#define		EAC_ODL          1				/*	开门灯	*/		
#define		EAC_CDL          2				/*	关门灯	*/	
#define		EAC_OAC          3				/*	开空调	*/	
#define		EAC_CAC          4				/*	关空调	*/	
#define		EAC_SAT          5  			/*	设置空调温度	*/		
#define		EAC_OWH          6				/*	开热水器	*/		
#define		EAC_CWH          7				/*	关热水器	*/		
#define		EAC_SWT          8				/*	设置热水器温度	*/		
#define		EAC_STL          11 			/*	切换感温和感光功能	*/		
#define		EAC_THF          12				/*	检测小偷	*/		
#define		EAC_GAL          13				/*	检测煤气泄露	*/		



/*
*********************************************************************************************************
*                                         
*											 LCD 页面编码
*********************************************************************************************************
*/
#define		LCD_PAGE_MAIN          			0				/*	LCD主页面	*/		
#define		LCD_PAGE_SELECT_SETING     		1				/*	LCD设置选择页面	*/		
#define		LCD_PAGE_SELECT_MODEL    	  	2				/*	LCD模式选择页面	*/		
#define		LCD_PAGE_SELECT_ELEC         	3				/*	LCD家电选择页面	*/		
#define		LCD_PAGE_SELECT_SYS          	4				/*	LCD系统开关机选择页面	*/		
#define		LCD_PAGE_SETING_TIME          	5				/*	LCD时间设置页面	*/		
#define		LCD_PAGE_SETING_DOOR_LIGHT      6				/*	LCD门灯设置页面	*/		
#define		LCD_PAGE_SETING_BEDROOM_LIGHT   7				/*	LCD卧室灯设置页面	*/		
#define		LCD_PAGE_SETING_AIRCONDITION    8				/*	LCD空调设置页面	*/		
#define		LCD_PAGE_SETING_CALORIFIER      9				/*	LCD热水器设置页面	*/		
#define		LCD_PAGE_POWER_ON      			10				/*	LCD开机页面	*/		
#define		LCD_PAGE_POWER_OFF      		11				/*	LCD关机页面	*/		
/*
*********************************************************************************************************
*                                         
*											 错误类型
*********************************************************************************************************
*/
#define		SUCCESS                  	  	 0			/*	执行成功	*/		
#define		EAC_OPENLIGHT_ERROR       		 1			/*	开灯错误	*/	
#define		EAC_CLOSELIGHT_ERROR      		 2 			/*	关灯错误	*/	
#define		EAC_OPENAIRCOND_ERROR      		 3			/*	开空调错误	*/	
#define		EAC_CLOSEAIRCOND_ERROR    		 4			/*	关空调错误	*/	
#define		EAC_OPENWATERHEATER_ERROR  		 5			/*	开热水器错误	*/		
#define		EAC_CLOSEWATERHEATER_ERROR 		 6			/*	关热水器错误	*/	
#define		EAC_THIEFFOUND_ERROR       		 9 			/*	小偷函数执行错误	*/		
#define		EAC_GASLEAK_ERROR          		 10			/*	煤气泄漏函数执行错误	*/		
#define		EAC_SWAPTANDL_ERROR        		 11			/*	切换感温感光错误	*/		
#define		EAC_SETAIRCONDTEMP_ERROR   		 12			/*	设置空调温度错误	*/		
#define		EAC_SETWATERHEATERTEMP_ERROR 	 13			/*	设置热水器温度错误	*/		

/*
*********************************************************************************************************
*                                         
*											 任务优先级
*********************************************************************************************************
*/
#define	TASK_PRIO_START				0				   /*	开始任务优先级	*/
#define TASK_PRIO_KEYDEC			1				   /*	按键检测任务优先级	*/
#define TASK_PRIO_PCDEC				5				   /*	PC端信息检测任务优先级	*/
#define TASK_PRIO_TIMING			7				   /*	定时任务优先级	*/
#define TASK_PRIO_KEY_PARSE			9				   /*	信息解析任务优先级	*/
#define TASK_PRIO_PC_PARSE			13
#define TASK_PRIO_EVENTHDL			11				   /*	事件处理任务优先级	*/

/*
*********************************************************************************************************
*                                         
*											 任务堆栈大小
*********************************************************************************************************
*/
#define		TASK_STK_SIZE	  		64				   /*	任务堆栈大小	*/

/*
*********************************************************************************************************
*                                         
*											 全局数组大小定义
*********************************************************************************************************
*/
#define		OS_STATE_INFO_SIZE	  	9				   /*	系统状态信息表大小	*/
#define		TIMING_TBL_SIZE	  		4				   /*	系统定时任务表大小	*/


/*
*********************************************************************************************************
*                                         
*											 系统进入省电状态标志
*********************************************************************************************************
*/
#define		OS_ENTER_POWERSAVING	900		//(15 * 60)标志到15s 的时钟节拍数	15s未检测到按键值 系统进入省电状态


/*
*********************************************************************************************************
*                                         
*											 LCD寄存器设置
*********************************************************************************************************
*/
#define LCD_A0 (0x1<<18)
#define LCD_WR (0x1<<16)
#define LCD_CS (0x1<<24)
#define LCD_RD (0x1<<17)
#define LCD_RES (0x1<<19)
#define LCD_DATA ((0x3<<25)|(0x3F<<2))

#define H_LCD_A0 (IOSET = LCD_A0)
#define L_LCD_A0 (IOCLR = LCD_A0)
#define H_LCD_WR (IOSET = LCD_WR)
#define L_LCD_WR (IOCLR = LCD_WR)
#define H_LCD_CS (IOSET = LCD_CS)
#define L_LCD_CS (IOCLR = LCD_CS)
#define H_LCD_RD (IOSET = LCD_RD)
#define L_LCD_RD (IOCLR = LCD_RD)
#define H_LCD_RES (IOSET = LCD_RES)
#define L_LCD_RES (IOCLR = LCD_RES)
#define Dis_X_MAX 239
#define Dis_Y_MAX 159
#define	PARAP9	  0x1e
//#define SUCCESS   1
//#define FAULT     0


/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
