/**********************************************************************************************************
**							文件名：	NMRQ_config.h
**                          功能说明：  本文件为IEACS系统相关配置文件
**                               		包含系统设计相关的全局变量定义、宏定义、数据类型定义
**                          作者：		程敏
**							创建时间： 	2013-8-1
**
********************************************************************************************************/



/*
********************************************************************************************************
*                                         系统全局变量
*********************************************************************************************************
*/
LCD_PAGE		*LCDCurrentPage;				/*	指向LCD当前界面的指针	*/
INT8U	   		 LCDCurrentFocus;				/*	LCD当前界面的当前焦点	*/
INT8U			 PCConnectState;				/*	PC当前连接状态	*/
TIME		  	 OSCurrentTime;					/*	系统时间	*/

KEY_INFO	 	 *OSCurrentKeyInfo;				/*	记录当前检测到的按键信息	*/
OS_STATE_INFO	 *OSCurrentPcInfo;				/*	记录当前检测到的PC端信息	*/

/********************************************
*	数组名：OSStateInfo
*	功能说明：系统状态表，保存系统状态信息
*	创建日期：2013-7-29
*	使用注意：数组大小需要根据系统实际需要设定，系统状态表内容需要设定
********************************************/

OS_STATE_INFO	OSStateInfo[20];

/********************************************
*	数组名：TimingTbl
*	功能说明：保存系统电器定时时间
*			  与TimingSW联合构成系统定时任务表
*	创建日期：2013-7-29
********************************************/

TIME	TimingTbl[4];

/********************************************
*	数组名：TimingSW
*	功能说明：保存系统电器定时开关信息
*			  与TimingTbl联合构成系统定时任务表
*	创建日期：2013-7-29
********************************************/

INT8U	TimingSW[4];



/*
********************************************************************************************************
*                                        	 系统宏定义
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*                                         OS STATE CTRL OBJ
*											系统控制对象
*********************************************************************************************************
*/
#define  OS_STATE_CTRL_OBJ_DOOR_LIGHT      0        /* 	表示当前系统控制对象为 门灯	*/ 
#define  OS_STATE_CTRL_OBJ_BEDROOM_LIGHT   1        /* 	表示当前系统控制对象为 卧室灯	*/ 
#define  OS_STATE_CTRL_OBJ_AIRCONDITION    2        /* 	表示当前系统控制对象为 空调	*/ 
#define  OS_STATE_CTRL_OBJ_CALORIFIER      3        /* 	表示当前系统控制对象为 热水器	*/ 
#define  OS_STATE_CTRL_OBJ_SYS   		   4        /* 	表示当前系统控制对象为 系统	*/ 
#define  OS_STATE_CTRL_OBJ_THIEF   		   5        /* 	表示当前系统控制对象为 小偷中断	*/ 
#define  OS_STATE_CTRL_OBJ_GASLEAK   	   6        /* 	表示当前系统控制对象为 煤气中断	*/ 

/*
*********************************************************************************************************
*                                         OS STATE INFO TYPE
*										   系统状态信息类型
*********************************************************************************************************
*/
#define  OS_STATE_INFO_TYPE_SWITCH  		   0        /* 	表示当前系统控制对象的信息类型为 开关	*/ 
#define  OS_STATE_INFO_TYPE_TEMP  		  	   1        /* 	表示当前系统控制对象的信息类型为 温度	*/ 
#define  OS_STATE_INFO_TYPE_MODEL  			   2        /* 	表示当前系统控制对象的信息类型为 模式	*/ 
#define  OS_STATE_INFO_TYPE_TIME  			   3        /* 	表示当前系统控制对象的信息类型为 时间	*/
#define  OS_STATE_INFO_TYPE_TIMEING  		   4        /* 	表示当前系统控制对象的信息类型为 定时	*/
#define  OS_STATE_INFO_TYPE_INT		  		   5        /* 	表示当前系统控制对象的信息类型为 中断	*/

/*
*********************************************************************************************************
*                                         OS PC CONNECT STATE
*											系统连接状态
*********************************************************************************************************
*/
#define  OS_PC_CONNECT_STATE_CONNECTLESS  		   0        /* 	表示PC端未连接到下位机	*/ 
#define  OS_PC_CONNECT_STATE_CONNECTED  		   1        /* 	表示PC端已连接到下位机	*/ 

/*
*********************************************************************************************************
*                                         OS ELEC SWITCH STATE
*											系统电器开关状态
*********************************************************************************************************
*/
#define  OS_ELEC_SWITCH_STATE_OFF  		   0        /* 	表示电器 关	*/ 
#define  OS_ELEC_SWITCH_STATE_ON  		   1        /* 	表示电器 开	*/ 

/*
*********************************************************************************************************
*                                         OS MODEL STATE
*											 系统模式
*********************************************************************************************************
*/
#define  OS_MODEL_STATE_COMMON  		   0        /* 	表示系统当前模式为 普通模式	*/ 
#define  OS_MODEL_STATE_BACK_HOME  		   1        /* 	表示系统当前模式为 回家模式	*/ 
#define  OS_MODEL_STATE_AGAINST_THEFT  	   2        /* 	表示系统当前模式为 防盗模式	*/ 
#define	 OS_MODEL_STATE_GO_OUT  		   3        /* 	表示系统当前模式为 外出模式	*/ 


/*
*********************************************************************************************************
*                                         
*											 布尔值
*********************************************************************************************************
*/
#define		FALSE               0			//FALSE为0		
#define		TRUE                1			//TRUE为1

/*
*********************************************************************************************************
*                                         
*											 行列线
*********************************************************************************************************
*/
#define		KC0         0x00100000			//p0.20引脚控制列线KC0		
#define		KC1         0x00200000			//p0.21引脚控制列线KC1		
#define		KH0         0x00400000 			//p0.22引脚控制行线KH0		
#define 	KH1         0x00800000			//po.21引脚控制行线KH1 ?		
#define		BEEP        0x000000400			//p0.10引脚控制BEEP，高电平使能		

/*
*********************************************************************************************************
*                                         
*											 按键
*********************************************************************************************************
*/
#define		KEY_SWI1            1			//按键1		
#define		KEY_SWI2            2			//按键2		
#define		KEY_SWI3            3			//按键3		
#define		KEY_SWI4            4			//按键4		
#define		KEY_CLICKED        TRUE 		//按键按下		
#define		KEY_UNCLICKED      FALSE		//按键未按下		
#define		KEY_LONGCLICKED    TRUE 		//按键为长按		
#define		KEY_SHORTCLICKED   FALSE		//按键为短按				


/*
*********************************************************************************************************
*                                         
*											 控制家电
*********************************************************************************************************
*/
#define		EAC_ODL          1				//开门灯		
#define		EAC_CDL          2				//关门灯		
#define		EAC_OAC          3				//开空调		
#define		EAC_CAC          4				//关空调		
#define		EAC_SAT          5  			//设置空调温度		
#define		EAC_OWH          6				//开热水器		
#define		EAC_CWH          7				//关热水器		
#define		EAC_SWT          8				//设置热水器温度		
#define		EAC_STL          11 			//切换感温和感光功能		
#define		EAC_THF          12				//检测小偷		
#define		EAC_GAL          13				//检测煤气泄露		

/*
*********************************************************************************************************
*                                         
*											 错误类型
*********************************************************************************************************
*/
#define		SUCCESS                  	  	 0			//执行成功		
#define		EAC_OPENLIGHT_ERROR       		 1			//开灯错误		
#define		EAC_CLOSELIGHT_ERROR      		 2 			//关灯错误		
#define		EAC_OPENAIRCOND_ERROR      		 3			//开空调错误		
#define		EAC_CLOSEAIRCOND_ERROR    		 4			//关空调错误		
#define		EAC_OPENWATERHEATER_ERROR  		 5			//开热水器错误		
#define		EAC_CLOSEWATERHEATER_ERROR 		 6			//关热水器错误		
#define		EAC_THIEFFOUND_ERROR       		 9 			//小偷函数执行错误		
#define		EAC_GASLEAK_ERROR          		 10			//煤气泄漏函数执行错误		
#define		EAC_SWAPTANDL_ERROR        		 11			//切换感温感光错误		
#define		EAC_SETAIRCONDTEMP_ERROR   		 12			//设置空调温度错误		
#define		EAC_SETWATERHEATERTEMP_ERROR 	 13			//设置热水器温度错误		






/*
********************************************************************************************************
*                                         系统数据类型定义
*********************************************************************************************************
*/

/********************************************
*	结构体名：TIME
*	功能说明：保存系统时间信息（系统时间、定时时间）
*	创建日期：2013-7-29
********************************************/

typedef struct {                            
    INT16U         uiTimeYear;           	/* 年	*/
    INT8U      	   uiTimeMonth;             /* 月	*/
    INT8U          uiTimeDay;            	/* 日	*/  

    INT8U          uiTimeHour;        		/* 时 	*/  
    INT8U          uiTimeMinute;       	    /* 分 	*/  
    INT8U          uiTimeSecond;       	    /* 秒	*/  
                                            
} TIME;


/********************************************
*	结构体名：OS_STATE_INFO
*	功能说明：保存系统当前状态信息
*	创建日期：2013-7-29
********************************************/

typedef struct {  
    INT8U          uiOSStateCtrlObj;            	/* 	系统控制对象（系统、门灯、卧室灯、空调、热水器）	*/  
                          
    INT8U      	   uiOSStateInfoType;               /*	系统状态信息类型(电器开关、温度、模式、时间）	*/

    void           *uiOSStateContent;        		/* 	系统控制对象所对应的信息类型的内容	*/  
													/* 	类型为void的指针（可以为开关信息（0/1）、
														模式（1、2、3、4）、温度、时间	*/
} OS_STATE_INFO;


/********************************************
*	结构体名：LCD_PAGE
*	功能说明：保存LCD界面
*	创建日期：2013-7-29
********************************************/

typedef struct {  
    INT8U          uiLcdPageID;            				/* 	LCD界面编码id	*/                           
    LCD_PAGE       *lcdPageNextPage[];                  /*	指向下一界面的指针数组	*/
    LCD_PAGE       *lcdPagePrePage;               		/*	指向前一节目的指针	*/

} LCD_PAGE;


/********************************************
*	结构体名：KEY_INFO
*	功能说明：保存按键信息
*	创建日期：2013-7-30
********************************************/

typedef struct {  
    INT8U          uiKeyType;            				/* 	按键类型（长按/短按）	*/                           
    INT8U          uiKeyValue;            				/* 	按键值（4个）	*/                           

} KEY_INFO;


/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
