/******************************************************************************
*						文件名：	main.c	
*                       文件描述：	本文件为系统的主函数入口 
*                       作者：		程敏
*						创建时间： 	2013-8-1
******************************************************************************/

#include "..\Include\config.h"
#include "..\Include\helper.h"
#include "..\Include\uart.h"
#include "..\Include\NMRQ_config.h"



OS_STK        TASK_StartStk[TASK_STK_SIZE];
									

extern void  TASK_Start(void *pdata);



	

//***************************************************************************
//* 函数名称 ：main()
//* 函数功能 ：uC/OS-II主函数，启动多任务环境。
//***************************************************************************

int main (void)
{	

    TargetInit(); 
    LCD_Init();

	OSInit();
    OSTaskCreate(TASK_Start, (void *)0, &TASK_StartStk[TASK_STK_SIZE - 1], TASK_PRIO_START);		

	OSStart();												
}


   
/******************************************************************************
*                            End Of File
******************************************************************************/

